Public Member Functions | Friends | List of all members
ACAPI::MEP::PhysicalSystem::Modifier Class Reference
MEP Element Manager
Modifier object for PhysicalSystem. More...
#include <MEPPhysicalSystem.hpp>
 Inheritance diagram for ACAPI::MEP::PhysicalSystem::Modifier:
 Public Member Functions
Result< void >  | SetRootElement (const UniqueID &rootElementId)
Set the currently assigned root element ID.
Result< void >  | SetName (const GS::UniString &name)
Set the name of the PhysicalSystem.
Result< void >  | SetSystemCategory (API_AttributeIndex index)
Set the system category of the PhysicalSystem.
 Friends
 class  | PhysicalSystem
Detailed Description
Modifier object for PhysicalSystem.
Since
Archicad 29
Member Function Documentation
◆ SetName()
 Result< void > ACAPI::MEP::PhysicalSystem::Modifier::SetName  |  ( |  const GS::UniString & |  name | )
Set the name of the PhysicalSystem.
Parameters
name | The new name of the PhysicalSystem
Returns
Nothing if the name was set successfully, otherwise an error
◆ SetRootElement()
 Result< void > ACAPI::MEP::PhysicalSystem::Modifier::SetRootElement  |  ( |  const UniqueID & |  rootElementId | )
Set the currently assigned root element ID.
Parameters
rootElementId | The UniqueID of the element to set as the new root element
Remarks
For a route to be a valid root, it requires that either one or both ends are not logically connected to another MEP element.
Returns
Nothing is the root element was set successfully, otherwise an error
◆ SetSystemCategory()
 Result< void > ACAPI::MEP::PhysicalSystem::Modifier::SetSystemCategory  |  ( |  API_AttributeIndex |  index | )
Set the system category of the PhysicalSystem.
Parameters
index | The attribute index of the system category to set
Returns
Nothing if the system category was set successfully, otherwise an error